{
   "AI-ML": [
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Imagine we have a dataset with a significant class imbalance. How would you handle this issue when building a machine learning model? Could you walk me through some techniques you might use to balance things out?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. In your deep learning projects, have you ever faced a situation where the model started overfitting on the training data? How did you tackle it, and what strategies did you use to improve the model's generalization?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Suppose you're designing an AI system for a financial application. What ethical considerations do you think are essential to ensure fairness and minimize bias in the model’s predictions?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. When you're working on a supervised learning model with a lot of missing data, how do you approach handling those missing values? What impact do you think your approach would have on the model’s performance?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You need to deploy a machine learning model in a production environment with limited computational resources. How would you optimize the model to ensure it's efficient in terms of both speed and memory usage?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. How do you decide whether to use collaborative filtering or content-based methods for a recommendation system? Can you share when it might be beneficial to combine the two approaches?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. If your model performs well on training data but poorly on the validation set, what could be the potential causes? How would you diagnose and resolve this issue?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. If you suspect that feature engineering is inadequate and affecting model performance, how would you approach improving the feature engineering process?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. For an NLP task, dealing with noisy and unstructured text data can be tough. How would you preprocess the data to enhance your model's performance?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Imagine you’re developing an AI/ML solution for an autonomous vehicle. How would you address potential safety and ethical concerns, especially in decision-making scenarios where the vehicle must choose between multiple possible outcomes?"
    ],
    "System-Design": [
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're tasked with designing an e-commerce platform that can handle millions of users concurrently. How would you ensure the system remains robust during large traffic spikes, especially during sales events?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Imagine you're optimizing the performance of a social media platform with millions of active users. How would you address the slowdowns during peak hours?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're developing a real-time messaging application where messages must be delivered instantly. How would you ensure the system is available and messages aren't lost even if some components fail?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're designing a cloud storage system that handles large volumes of data. How would you balance fast reads and writes while ensuring cost efficiency and fault tolerance?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. How would you explain the benefits of a microservices architecture to a non-technical stakeholder?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're responsible for designing a payment processing system that handles concurrent transactions efficiently. How would you ensure reliability and prevent issues like timeouts or duplicate processing during peak events?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're building a recommendation engine for an online store. How would you incorporate user preferences, previous interactions, and item characteristics to deliver personalized suggestions?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're tasked with designing a global, real-time ride-sharing platform. How would you handle booking rides, tracking drivers, and supporting various payment options across multiple countries?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Your company has a distributed database showing inconsistent states due to network partitioning. How would you address data synchronization and availability issues?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're designing a video streaming platform for millions of concurrent users watching HD content. How would you ensure the platform scales dynamically and maintains performance during traffic spikes?"
    ],
    "Product-Manager": [
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're working on a new AI-powered feature, and its performance heavily depends on the training data quality. How would you evaluate whether the existing data is suitable for training the model?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. A competitor has released a feature similar to what you planned for the next quarter. How would you evaluate whether to proceed with your feature or pivot?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. The product launch is delayed by two weeks due to technical issues, causing stakeholder frustration. How would you address this and get the project back on track?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. There’s a disagreement between your technical and non-technical teams about a feature's feasibility. How would you communicate the technical constraints to ensure alignment between both sides?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. A conflict arises between engineers and designers over a feature implementation. How would you mediate the situation and ensure the team continues to work effectively?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. The product roadmap has changed several times in the last month. How would you present the new plan to ensure all stakeholders are on the same page and understand the reasons behind the changes?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You've realized that implementing a planned AI/ML feature is far more complex than anticipated. What steps would you take to reassess and manage its development?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Your product is performing well in its core market, but you've identified a new potential market segment. How would you validate this opportunity and convince stakeholders to prioritize it?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. Your product has received negative feedback about a recently launched feature. How would you approach resolving this issue and improving the feature?",
        "Hello! Welcome to the interview, and thank you for joining us today. Let's kick things off with an exciting challenge. You're overseeing a product developed by a distributed team across different time zones. How would you improve collaboration and streamline communication to avoid delays and confusion?"
    ]
}
